natural_disaster = ['태풍', '호우','폭설', '지진/해일', '산사태', '우박', '낙뢰/뇌우', '황사/미세먼지','한파', '강풍', '가뭄', '산불', '폭염']
social_disaster = ['화재', '건축물붕괴','폭발', '도로교통사고', '철도/지하철 사고', '정전/전력부족', '감염병','테러사고', '인파사고']
disaster = set(natural_disaster+social_disaster)

related_words_dict = {
    '태풍': ['바람', '우산', '창문', '깨짐'],
    '호우': ['비', '침수', '물난리'],
    '폭설': ['눈', '얼음', '도로막힘'],
    '지진/해일': ['진동', '해수면', '침수', '안전'],
    '산사태': ['산사태', '붕괴', '안전'],
    '우박': ['우박', '비', '창문', '안전'],
    '낙뢰/뇌우': ['낙뢰', '번개', '안전'],
    '황사/미세먼지': ['황사', '미세먼지', '호흡', '마스크'],
    '한파': ['한파', '동상', '난방', '온도'],
    '강풍': ['강풍', '바람', '나무', '날아감'],
    '가뭄': ['가뭄', '물부족', '절약', '농작물'],
    '산불': ['산불', '불', '대피', '소화'],
    '폭염': ['폭염', '더위', '수분섭취', '선크림'],
    '화재': ['불', '소화기', '화염', '대피'],
    '건축물붕괴': ['붕괴', '구조물', '안전'],
    '폭발': ['폭발', '음폭', '대피', '안전'],
    '도로교통사고': ['교통사고', '차량', '보행자', '신호'],
    '철도/지하철 사고': ['기차', '지하철', '사고', '대피'],
    '정전/전력부족': ['정전', '전력부족', '손전등', '저장'],
    '감염병': ['감염병', '전염', '예방', '백신'],
    '테러사고': ['테러', '폭탄', '대피', '신고', '칼'],
    '인파사고': ['인파사고', '군중', '안전', '대피']
}

# Create a reverse mapping of disaster elements to words
disaster_to_word_mapping = {}
for disaster, words in related_words_dict.items():
    for word in words:
        if word in disaster_to_word_mapping:
            disaster_to_word_mapping[word].append(disaster)
        else:
            disaster_to_word_mapping[word] = [disaster]
